[
    {
        "url": "https://en.wikipedia.org/wiki/Artificial_intelligence",
        "title": "Artificial intelligence",
        "content": "Artificial intelligence(AI) is the capability ofcomputational systemsto perform tasks typically associated withhuman intelligence, such aslearning,reasoning,problem-solving,perception, anddecision-making. It is afield of researchincomputer sciencethat develops and studies methods andsoftwarethat enable machines toperceive their environmentand uselearningandintelligenceto take actions that maximize their chances of achieving defined goals.[1] High-profileapplications of AIinclude advancedweb search engines(e.g.,Google Search);recommendation systems(used byYouTube,Amazon, andNetflix);virtual assistants(e.g.,Google Assistant,Siri, andAlexa);autonomous vehicles(e.g.,Waymo);generativeandcreativetools (e.g.,language modelsandAI art); andsuperhumanplay and analysis instrategy games(e.g.,chessandGo). However, many AI applications are not perceived as AI: \"A lot of cutting edge AI has filtered into general applications, often without being called AI because once something becomes useful enough and common enough it'snot labeled AI anymore.\"[2][3] Various subfields of AI research are centered around particular goals and the use of particular tools. The traditional goals of AI research include learning,reasoning,knowledge representation,planning,natural language processing,perception, and support forrobotics.[a]To reach these goals, AI researchers have adapted and integrated a wide range of techniques, includingsearchandmathematical optimization,formal logic,artificial neural networks, and methods based onstatistics,operations research, andeconomics.[b]AI also draws uponpsychology,linguistics,philosophy,neuroscience, and other fields.[4]Some companies, such asOpenAI,Google DeepMindandMeta,[5]aim to createartificial general intelligence(AGI)—AI that can complete virtually any cognitive task at least as well as a human. Artificial intelligence was founded as an academic discipline in 1956,[6]and the field went through multiple cycles of optimism throughoutits history,[7][8]followed by periods of disappointment and loss of funding, known asAI winters.[9][10]Funding and interest vastly increased after 2012 whengraphics processing unitsstarted being used to accelerate neural networks anddeep learningoutperformed previous AI techniques.[11]This growth accelerated further after 2017 with thetransformer architecture.[12]In the 2020s, an ongoing period of rapidprogressin advanced generative AI became known as theAI boom. Generative AI's ability to create and modify content has led to several unintended consequences and harms, which has raisedethical concernsaboutAI's long-term effectsandpotential existential risks, prompting discussions aboutregulatory policiesto ensurethe safetyand benefits of the technology. The general problem of simulating (or creating) intelligence has been broken into subproblems. These consist of particular traits or capabilities that researchers expect an intelligent system to display. The traits described below have received the most attention and cover the scope of AI research.[a] Early researchers developed algorithms that imitated step-by-step reasoning that humans use when they solve puzzles or make logicaldeductions.[13]By the late 1980s and 1990s, methods were developed for dealing withuncertainor incomplete information, employing concepts fromprobabilityandeconomics.[14] Many of these algorithms are insufficient for solving large reasoning problems because they experience a \"combinatorial explosion\": They become exponentially slower as the problems grow.[15]Even humans rarely use the step-by-step deduction that early AI research could model. They solve most of their problems using fast, intuitive judgments.[16]Accurate and efficient reasoning is an unsolved problem. Knowledge representationandknowledge engineering[17]allow AI programs to answer questions intelligently and make deductions about real-world facts. Formal knowledge representations are used in content-based indexing and retrieval,[18]scene interpretation,[19]clinical decision support,[20]knowledge discovery (mining \"interesting\" and actionable inferences from largedatabases),[21]and other areas.[22] Aknowledge baseis a body of knowledge represented in a form that can be used by a program. Anontologyis the set of objects, relations, concepts, and properties used by a particular domain of knowledge.[23]Knowledge bases need to represent things such as objects, properties, categories, and relations between objects;[24]situations, events, states, and time;[25]causes and effects;[26]knowledge about knowledge (what we know about what other people know);[27]default reasoning(things that humans assume are true until they are told differently and will remain true even when other facts are changing);[28]and many other aspects and domains of knowledge. Among the most difficult problems in knowledge representation are the breadth ofcommonsense knowledge(the set of atomic facts that the average person knows is enormous);[29]and the sub-symbolic fo"
    },
    {
        "url": "https://en.wikipedia.org/wiki/AI_(disambiguation)",
        "title": "Ai",
        "content": "AImost frequently refers toartificial intelligence, which is intelligence demonstrated by machines. Ai,AIorA.I.may also refer to:"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Ai_(chimpanzee)",
        "title": "Ai (chimpanzee)",
        "content": "Ai(born in 1976, estimated) is a femalewestern chimpanzee(Pan troglodytes verus),[1]currently living at thePrimate Research InstituteofKyoto University(acronym KUPRI). She is the first subject of theAi project, a research program started in 1978 by Kiyoko Murofushi andTetsuro Matsuzawaaimed at understanding chimpanzeecognitionthrough computer interface experiments.[2] Ai was born in 1976 (estimated) in theGuinean Forests of West Africa.[1]Born wild, Ai was soon taken into captivity and sold to KUPRI in 1977 by an animal trader (this type of sale became illegal in 1980 withJapan's ratification ofCITES).[1]She was the first subject of KUPRI's chimpanzee project, which was intended to become Japan's first ape-language study in the vein of earlierape-language studies.[2]Ai was joined at KUPRI the following year by two more chimpanzees, Akira and Mari.[3]In 2000, Ai gave birth to a son,Ayumu. Matsuzawa has written that the difference between the Ai Project and earlier ape-language studies is that he was less interested in seeing if Ai and the other chimpanzees were capable of learning some degree of human language than trying to understand how chimpanzees perceive their surroundings.[2]To study this, the research team created a customized keyboard for Ai and the other chimpanzees at KUPRI to interact with a computer. The computer was used to standardize the studies and reduce variation that might be introduced by human researchers.[1]Researchers have studied Ai's memory, number-learning, and perception of color. Matsuzawa wrote that Ai was \"the first chimpanzee who learned to use Arabic numerals to represent numbers,\" and her ordering of different shades and hues ofMunsell color chipswas similar to human orderings.[2] In 2000, not long after the birth of three chimpanzees, Ai's group numbered 15;[1]in 2010, there were 14 members.[4]This is similar to the size of some small chimpanzee groups in the wild, where in some places with stable food supplies group size hovers at around 20 chimpanzees.[5]Matsuzawa has attempted to blend elements of laboratory and field research, and KUPRI has an outdoor complex for the chimpanzees called the Ape Research Annex, built in 1995, with an 8-meter tall tower, a river, and trees.[3] After Ai gave birth to her son, Ayumu, in 2000, they were placed in a \"twin booth\" where Ayumu could live with Ai in one booth but also be exposed to the researcher in the other booth every day, making the researcher an integral part of Ayumu's life and studying him in front of Ai, with her implicit approval.[6]Matsuzawa wrote that: Two almost identical booths are placed side by side. There is a door between the two booths that can alternately be opened to connect the two areas, closed to separate the two individuals, or positioned half-open to allow the young chimpanzee to crawl from one area to the other while preventing the mother chimpanzee from entering the neighboring booth.[6] This method allowed the research team to consistently track Ayumu's development without interfering excessively with the mother-offspring relationship. Ai loves to paint and draw –– she started drawing at a young age –– and is often brought art materials for free-drawing or painting.[6]She creates art as an end in itself, without a food reward. In 2013 she made a painting that was given to the president of Kyoto University; later, in honor of the 40th anniversary of her arrival at KUPRI, this painting was made into a silk scarf and given as a gift toJane Goodall.[6]"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Species",
        "title": "Species",
        "content": "Aspecies(pl.species) is the basic unit ofclassificationand ataxonomic rankof an organism, as well as a unit ofbiodiversity. It can be defined as the largest group oforganismsin which any two individuals of the appropriatesexesormating typescan produce fertileoffspring, typically bysexual reproduction. Other ways of defining species include theirkaryotype,DNAsequence,morphology, behaviour, orecological niche. In addition,palaeontologistsuse the concept of thechronospeciessincefossilreproduction cannot be examined. The most recent rigorous estimate for the total number of species ofeukaryotesis between 8 and 8.7 million.[1][2][3]About 14% of these had been described by 2011.[3]All species (exceptviruses) are given atwo-part name, a \"binomen\". The first part of a binomen is the name of agenusto which the species belongs. The second part is called thespecific nameor thespecific epithet(inbotanical nomenclature, also sometimes inzoological nomenclature). For example,Boa constrictoris one of the species of the genusBoa, withconstrictorbeing the specific name. While the definitions given above may seem adequate at first glance, when looked at more closely they represent problematic species concepts. For example, the boundaries between closely related species become unclear withhybridisation, in aspecies complexof hundreds of similarmicrospecies, and in aring species. Also, among organisms that reproduce onlyasexually, the concept of a reproductive species breaks down, and each clonal lineage is potentially a microspecies. Although none of these are entirely satisfactory definitions, and while the concept of species may not be a perfect model of life, it is still a useful tool to scientists andconservationistsfor studying life on Earth, regardless of the theoretical difficulties. If species were fixed and distinct from one another, there would be no problem, butevolutionaryprocesses cause species to change. This obligestaxonomiststo decide, for example, when enough change has occurred to declare that a fossil lineage should be divided into multiplechronospecies, or when populations have diverged to have enough distinct character states to be described ascladisticspecies. Species and higher taxa were seen fromAristotleuntil the 18th century as categories that could be arranged in a hierarchy, thegreat chain of being. In the 19th century, biologists grasped that species could evolve given sufficient time.Charles Darwin's 1859 bookOn the Origin of Speciesexplained howspecies could arisebynatural selection. That understanding wasgreatly extended in the 20th centurythroughgeneticsand populationecology. Genetic variability arises frommutationsandrecombination, while organisms are mobile, leading togeographical isolationandgenetic driftwith varyingselection pressures. Genes can sometimes be exchanged between species byhorizontal gene transfer; new species can arise rapidly through hybridisation andpolyploidy; and species may becomeextinctfor a variety of reasons.Virusesare a special case, driven by abalance of mutation and selection, and can be treated asquasispecies. Biologists and taxonomists have made many attempts to define species, beginning frommorphologyand moving towardsgenetics. Early taxonomists such as Linnaeus had no option but to describe what they saw: this was later formalised as the typological or morphological species concept.Ernst Mayremphasised reproductive isolation, but this, like other species concepts, can be hard or even impossible to test for groups of organisms separated in space or time.[4][5]Later biologists have tried to refine Mayr's definition with the recognition and cohesion concepts, among others.[6]Many of the concepts are quite similar or overlap, so they are not easy to count: the biologist R. L. Mayden recorded about 24 concepts,[7]and the philosopher of science John Wilkins counted 26.[4]Wilkins further grouped the species concepts into seven basic kinds of concepts: (1)agamospeciesfor asexual organisms (2) biospecies for reproductively isolated sexual organisms (3)ecospeciesbased on ecological niches (4) evolutionary species based on lineage (5) genetic species based on gene pool (6) morphospecies based on form or phenotype and (7) taxonomic species, a species as determined by a taxonomist.[8] A typological species is a group of organisms in which individuals conform to certain fixed properties (a type, which may be defined by a chosen 'nominal species'), so that even pre-literate people often recognise the same taxon as do modern taxonomists.[10][11]Modern-day field guides and identification websites such asiNaturalistuse this concept.  The clusters of variations or phenotypes within specimens (such as longer or shorter tails) would differentiate the species. This method was used as a \"classical\" method of determining species, such as with Linnaeus, early in evolutionary theory. However, different phenotypes are not necessarily different species (e.g. a four-wingedDrosophilaborn to"
    },
    {
        "url": "https://en.wikipedia.org/wiki/Species_(disambiguation)",
        "title": "Species (disambiguation)",
        "content": "Aspeciesis one of the basic units of biological classification. Speciesmay also refer to: The Species film series"
    }
]